Revit 2024 API
AdaptiveComponentInstanceUtils.GetInstancePointElementRefIds Method
 Gets Adaptive Point Element Ref ids to which the instance geometry adapts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static IList<ElementId> GetInstancePointElementRefIds(
	FamilyInstance famInst
)
Visual Basic
Public Shared Function GetInstancePointElementRefIds ( _
	famInst As FamilyInstance _
) As IList(Of ElementId)
Visual C++
public:
static IList<ElementId^>^ GetInstancePointElementRefIds(
	FamilyInstance^ famInst
)
Parameters
famInst
Type: Autodesk.Revit.DB.FamilyInstance
 The FamilyInstance.
Return Value
 The Adaptive Point Element Ref ids to which the instance geometry adapts.
Remarks
 The output contains both placement point ref ids and the shape handles point ref ids. The order corresponds to the same order as that of the Adaptive Points in the Family (which may not be ordered as per their placement number). Will return an empty array if there are no placement points and shape handles. To manipulate such an instance the following methods can be useful: 1) RehostAdaptiveComponentInstanceWithNoPlacementPoints() 2) MoveAdaptiveComponentInstance()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The FamilyInstance famInst is not an Adaptive Family Instance. -or- The FamilyInstance famInst does not have an Adaptive Family Symbol.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation failed.
See Also
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace